In [1]:
import pandas as pd
import numpy as np

from pandas import DataFrame, Series
from numpy.random import randn

In [2]:
data = Series(['One','Two',np.nan,'four'])
data

0     One
1     Two
2     NaN
3    four
dtype: object

In [3]:
data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
data.dropna()

0     One
1     Two
3    four
dtype: object

In [5]:
dframe = DataFrame([[1,2,3], [np.nan,5,6], [7, np.nan,9], [np.nan, np.nan, np.nan]])
dframe

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [6]:
clean_dframe = dframe.dropna()
clean_dframe

     0    1    2
0  1.0  2.0  3.0

In [7]:
dframe.dropna(how='all')

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [8]:
dframe.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [9]:
npn = np.nan

dframe2 = DataFrame([[1,2,3,npn], [4,npn,5,6],[npn,7,npn,9],[1,npn,npn,npn]])

dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  4.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [10]:
dframe2.dropna(thresh=2)

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  4.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0

In [11]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  4.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [12]:
dframe2.fillna(1)

     0    1    2    3
0  1.0  2.0  3.0  1.0
1  4.0  1.0  5.0  6.0
2  1.0  7.0  1.0  9.0
3  1.0  1.0  1.0  1.0

In [13]:
dframe2.fillna(0,inplace=True)

In [15]:
dframe2

     0    1    2    3
0  1.0  2.0  3.0  0.0
1  4.0  0.0  5.0  6.0
2  0.0  7.0  0.0  9.0
3  1.0  0.0  0.0  0.0